# 1) SQL QUERY FOR BOOKING & REVENUE

In [23]:
import pandas as pd
import sqlalchemy
import pymysql
import numpy as np
import datetime
import calendar
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' 
SELECT billing_cust_city, Sample_Date,Agent_name,Manager_Name,Dept_Name,booked_from,
delivery_status,
		COUNT(order_id) Bookings, 	
		
		COUNT(IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date,order_id,
                          IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date,order_id,
                          IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13),order_id,NULL)))) 'Allocated_count',
                          
                    SUM(IF((is_sample_collected = 1 AND channel_type=0),1,
                     IF((is_sample_collected=1 AND channel_type<>0 AND payed_amount>0),1,0))) 'Picked_Orders', 

SUM(IF(delivery_status IN (3),1,0)) AS 'Cancelled_orders',

SUM(IF(delivery_status IN (13,26,27),1,0)) AS 'Rescheduled_OnHold_Orders',
                     
                     
                     SUM(IF((is_sample_collected = 1 AND channel_type=0),1,0)) 'Picked_Orders_B2C',
                     
                     SUM(IF((is_sample_collected=1 AND channel_type<>0 AND payed_amount>0),1,0)) 'Picked Orders_B2B', 
                     

                   SUM(IF(ref_booking_id = 0 AND delivery_status IN (0,-1,3,13),order_price,IF(ref_booking_id = 0 
                       AND delivery_status NOT IN (0,-1,3,13),allocated_amount,0))) 'BOOKING_AMOUNT',
                   
                   
		   SUM(IF(DATE(order_date) < CURDATE(),IF(delivery_status IN (0,-1,3,13), order_price, 
		   IF(DATE(sample_collection_time) <= CURDATE(), allocated_amount, order_price)), 
		   IF(delivery_status NOT IN (0,-1,3),order_price,0))) AS 'booking_amount_New',
                     
                   
                   
                          SUM(IF(sample_collecor_id >0 AND delivery_status = 3 AND sample_collection_time < cancelled_date,allocated_amount,
                          IF(sample_collecor_id >0 AND delivery_status = 13 AND sample_collection_time < reshedule_date,allocated_amount,
                          IF(sample_collecor_id >0 AND delivery_status NOT IN (3,13),allocated_amount,0)))) 'Allocated_amount',
                                    
                     
         
                     SUM(IF((is_sample_collected = 1 AND channel_type=0), payed_amount,
                     IF((is_sample_collected=1 AND channel_type<>0 AND payed_amount>0),payed_amount,0))) 'Overall_Revenue',
                     
                     
                     SUM(IF((New_no = Old_no AND is_sample_collected = 1 AND channel_type=0), payed_amount,
                     IF((New_no = Old_no AND is_sample_collected=1 AND channel_type<>0 AND payed_amount>0),payed_amount,0))) 'Overall_Revenue_Existing',
                     
                   
                     
                     SUM(IF(is_sample_collected = 1 AND channel_type=0, payed_amount,0)) 'Revenue_B2C',
                     
                     SUM(IF(is_sample_collected=1 AND channel_type<>0 AND payed_amount>0,payed_amount,0)) 'Revenue_B2B',
                     
                     
                     SUM(IF((booked_from != 'phlebo_app' AND is_sample_collected=1
                     AND payed_amount > allocated_amount),payed_amount - allocated_amount,
                     IF((booked_from = 'phlebo_app' AND is_sample_collected=1),payed_amount,0))) 
                     'Phlebo_addon',

               
                     
                     SUM(IF(sample_collection_time > NOW()
                     AND delivery_status NOT IN (-1,0,1,3,13,18,23),order_price,0)) need_to_be_collected ,
                     SUM(Existing_cust_order_count) 'Existing_cust_order',
                     COUNT(DISTINCT c_order_id) 'customer_count'
                     
                     FROM (
                     SELECT X.billing_cust_tel 'Old_no',X1.billing_cust_tel 'New_no',
                     IF(X.billing_cust_tel = X1.billing_cust_tel,1,0)'Existing_cust_order_count',                     
                     X.is_sample_collected, X.sample_collecor_id,allocated_amount,billing_cust_city,
                     X.order_id, X.ref_booking_id,X.order_price, X.payed_amount, X.sample_collection_time, 
                     X.order_date, X.delivery_status,X.booked_from,X.created_by,X.channel_type,
                     X.Agent_name,X.Manager_Name,X.Dept_Name,DATE(X.sample_collection_time) 'Sample_Date',X1.Max_date,
                     X.cancelled_date,X.reshedule_date,
                     cancelled_after,reshedule_after,X.allocated_amount_new,X.allocated_count_new, X.c_order_id
                                 
                     FROM
                     
                     (SELECT d.billing_cust_tel,d.is_sample_collected, d.sample_collecor_id,allocated_amount,billing_cust_city,
                     GROUP_CONCAT(DISTINCT u.contact_number), d.order_id, d.ref_booking_id,d.order_price, d.payed_amount, d.sample_collection_time, 
                     d.order_date, d.delivery_status,d.booked_from,d.created_by,d.channel_type,
                     IF(d.booked_from = 'crm',cu.name,IF(d.booked_from = 'phlebo_app',sc.name,0))
                     AS 'Agent_name',IF(d.booked_from = 'crm',cu1.name, IF(d.booked_from = 'phlebo_app',cu2.name,0)) AS 'Manager_Name',
                     IF(d.booked_from = 'crm',dm.dept_name,IF(d.booked_from='phlebo_app',dm1.dept_name,0)) AS 'Dept_Name',
                     camp_id,od.cancelled_date, d.reshedule_date,c_order_id,
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,1,0) 'cancelled_after',
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,1,0) 'reshedule_after',
                     
                     IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,allocated_amount,
                          IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,allocated_amount,
                          IF(d.sample_collecor_id >0 AND d.delivery_status NOT IN (3,13),allocated_amount,0))) 'allocated_amount_new',
                          
                      IF(d.sample_collecor_id >0 AND d.delivery_status = 3 AND d.sample_collection_time < od.cancelled_date,1,
                          IF(d.sample_collecor_id >0 AND d.delivery_status = 13 AND d.sample_collection_time < d.reshedule_date,1,
                          IF(d.sample_collecor_id >0 AND d.delivery_status NOT IN (3,13),1,0))) 'allocated_count_new'
                     
                     
                     FROM deal_order_management d 
                     LEFT JOIN deal_orders_child doc ON d.order_id = doc.order_id
                     LEFT JOIN order_details od ON doc.c_order_id = od.doc_id 
                     LEFT JOIN deal_user_management u ON doc.cust_id = u.user_id 
                    
                     LEFT JOIN crm_users AS cu ON d.created_by = cu.id
                     LEFT JOIN sample_collector sc ON d.created_by = sc.sid
                     LEFT JOIN crm_users AS cu1 ON cu1.id = cu.reporting_to
                     LEFT JOIN crm_users AS cu2 ON sc.supervisorID = cu2.id
                     LEFT JOIN dept_master AS dm ON dm.id = cu.dept_id
                     LEFT JOIN dept_master AS dm1 ON dm1.id = sc.dept_id
                     WHERE DATE(d.sample_collection_time) = CURDATE() 
                     GROUP BY d.order_id) X
                     LEFT JOIN
                     (SELECT dom.billing_cust_tel, MAX(DATE(dom.sample_collection_time)) 'Max_date', COUNT(dom.order_id) FROM deal_order_management dom
                     WHERE DATE(dom.sample_collection_time) < (LAST_DAY(CURDATE() - INTERVAL 1 MONTH)+ INTERVAL 1 DAY) GROUP BY dom.billing_cust_tel) X1
                     ON X.billing_cust_tel = X1.billing_cust_tel GROUP BY X.order_id) X2
                     GROUP BY billing_cust_city,Sample_Date,Agent_name,dept_name'''
df_master = pd.read_sql_query(query,engine)
engine.dispose()
df_master.head()

,billing_cust_city,Sample_Date,Agent_name,Manager_Name,Dept_Name,booked_from,delivery_status,Bookings,Allocated_count,Picked_Orders,...,booking_amount_New,Allocated_amount,Overall_Revenue,Overall_Revenue_Existing,Revenue_B2C,Revenue_B2B,Phlebo_addon,need_to_be_collected,Existing_cust_order,customer_count
0,Agra,2019-05-30,0,0,0,mobile,5,1,1,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1
1,Agra,2019-05-30,Ankush Kumar Bharti,Saraswati,Outbound Sales,crm,5,1,1,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1
2,Agra,2019-05-30,Arun rajak,Manish Sanon,Inbound Sales,crm,5,1,1,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1
3,Agra,2019-05-30,Bhanu Yadav,Prateek Sharma,Outbound Sales,crm,5,1,1,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1
4,Agra,2019-05-30,Chetan Bhardwaj,Bhawna Anand,Outbound Sales,crm,5,1,1,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1

# 2) SQL QUERY FOR GROSS MARGIN

In [24]:

engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = ''' SELECT SUM(od.addon_cost)AS sum_addon_cost,dom.payed_amount AS payed_amount,dom.sample_collection_time,dom.order_id, billing_cust_city, dom.booked_from,
 dom.allocated_amount,DATE(dom.sample_collection_time)
	
	FROM deal_order_management dom LEFT JOIN deal_orders_child doc ON dom.order_id = doc.order_id
LEFT JOIN order_details od ON doc.c_order_id = od.doc_id

WHERE od.id IS NOT NULL AND
dom.is_sample_collected = 1 AND channel_type = 0 AND
dom.delivery_status NOT IN (-1,0,3,13) AND 
doc.delivery_status NOT IN (-1,2,3,4,5,6,13,14,18,23,27) AND doc.addon_flag != -1 AND
(od.order_delivery_status NOT IN (-1,2,3,4,5,6,13,14,18,23,27) OR  od.order_delivery_status IS NULL)
AND od.addon_flag !=-1 
AND DATE(dom.sample_collection_time)= CURDATE()

AND (dom.role_id NOT IN (6,27) AND dom.created_by NOT IN (124,230,509))
 
GROUP BY dom.order_id'''
df_margin = pd.read_sql_query(query,engine)
engine.dispose()
df_margin.head()

Empty DataFrame
Columns: [sum_addon_cost, payed_amount, sample_collection_time, order_id, billing_cust_city, booked_from, allocated_amount, DATE(dom.sample_collection_time)]
Index: []

# 3) SQL QUERY FOR LEADS DATA

In [25]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''SELECT mas.city_check_final AS 'CITY', mas.Google_Facebook AS 'Leads_Tag',DATE(mas.xcreated) 'created_on',
COUNT(DISTINCT mas.lead_id) AS 'Leads' FROM 
(
SELECT  DISTINCT	 
	 IF(IF(IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),
		IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))IS NULL, dom.billing_cust_city,
		  IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))) IS NULL,LEFT(lal.utm_campaign,LOCATE('-',lal.utm_campaign)-1),
		  
		  IF(IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))IS NULL, dom.billing_cust_city,
		  IF(lal.lead_source IN (8,13,14,18,36,37), 'NCR', 
	IF((IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) IS NULL OR  
		IF(lal.lead_city_name = '', dc.city_name,lal.lead_city_name) = '') AND 
		ad_name IS NOT NULL, 
		TRIM(SUBSTRING_INDEX(TRIM(SUBSTRING_INDEX(ad_name,'L:',-1)),',',1)),IF(lal.lead_city_name = '', dc.city_name,
		  lal.lead_city_name)))))	
		  AS city_check_final,
		  IF(lal.lead_source IN (3,4,118,122), "Premium leads","Non Premium leads") AS lead_tag,
		  IF(lal.lead_source = 3,"Facebook",IF(lal.lead_source IN (4,69,118,122),"Google",
		  IF(lal.lead_source IN (13,14,15,16,27,28,36,37,38,44,49,50,52,79,82,93,101,116),"SMS_Campaigns","Others")))'Google_Facebook',

lm.lead_id,dom.order_id,lal.lead_source,dc.city_name,DATE(lal.created_on) 'xcreated'
FROM lead_master AS lm
LEFT JOIN 
lead_activity_log AS lal ON lm.lead_id = lal.lead_id 
LEFT JOIN
deal_order_management AS dom ON dom.billing_cust_tel = lm.contact_number AND DATE(dom.order_date) >= DATE(lal.created_on)
LEFT JOIN
lead_source AS ls ON ls.id = lal.lead_source
LEFT JOIN
deal_city AS dc ON lal.lead_city = dc.city_id
LEFT JOIN
crm_users AS cu ON cu.id = lal.agent_id
WHERE DATE(lal.created_on) = (CURDATE() - INTERVAL 1 day)
AND lal.is_new_interest=1) AS mas
GROUP BY mas.city_check_final,mas.Google_Facebook,DATE(mas.xcreated)
ORDER BY mas.city_check_final,mas.Google_Facebook,DATE(mas.xcreated)'''
df_lead = pd.read_sql_query(query,engine)
engine.dispose()
df_lead.head()

   CITY Leads_Tag  created_on  Leads
0  None  Facebook  2019-05-29     45
1  None    Google  2019-05-29      1
2  None    Others  2019-05-29    402
3  agra  Facebook  2019-05-29     23
4  Agra    Google  2019-05-29      3

# 4) SQL QUERY FOR KIT COST

In [26]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''SELECT xdate, billing_cust_city, SUM(IF(bd = 'not_bd',custs,0)) 'NON_BD_customers'
FROM
(SELECT order_id, MIN(DATE(b1.sample_collection_time)) xmin, MAX(DATE(b1.sample_collection_time)) xmax, 
billing_cust_city, bd, COUNT(DISTINCT cust_id) custs, DATE(sample_collection_time) AS xdate
FROM
(SELECT d1.order_id, d1.cust_id, d.delivery_status, d.sample_collection_time, 
IF(d.billing_cust_city = 23,'Gurgaon',IF(d.billing_cust_city = 1595,'Delhi',d.billing_cust_city)) billing_cust_city, d.is_sample_collected, d.billing_cusT_name, d1.customer_name, d.payed_amount,
IF(d.channel_type = 0,'not_bd','bd') bd
FROM deal_order_management d
LEFT JOIN deal_orders_child d1
ON d.order_id = d1.order_id
WHERE DATE(d.sample_collection_time) = CURDATE()
AND is_sample_collected = 1
AND d.delivery_status IN (7,8,9,12,15,21,23,18,26,25,27,28)) b1
GROUP BY order_id) b2
GROUP BY billing_cust_city, xdate
ORDER BY 'NON_BD_customers' DESC'''
df_kit = pd.read_sql_query(query,engine)
df_kit['kit_cost'] = df_kit['NON_BD_customers']*33.5
engine.dispose()
df_kit.head()

Empty DataFrame
Columns: [xdate, billing_cust_city, NON_BD_customers, kit_cost]
Index: []

In [27]:
df_kit['kit_cost'] = df_kit['NON_BD_customers']*33.5
df_kit.head()

Empty DataFrame
Columns: [xdate, billing_cust_city, NON_BD_customers, kit_cost]
Index: []

# 5) SQL QUERY FOR FACEBOOK COST

In [28]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''
SELECT SUBSTRING(lcd.campaign_name,3,LOCATE(',',lcd.campaign_name,1)-3)
AS 'city',ROUND(SUM(sms_rate),2) AS 'Facebook_cost' FROM `lead_campaign_detail` lcd 
WHERE DATE(Date_time) = (CURDATE() - INTERVAL 1 day)
GROUP BY city'''
df_FBcost = pd.read_sql_query(query,engine)
engine.dispose()
df_FBcost.head()

                 city  Facebook_cost
0                          140099.06
1                AGRA        3021.14
2  AMRITSAR/JALANDHAR        2514.33
3   AMRITSAR/JALNDHAR         503.97
4           BENGALURU       15947.20

# 6) SQL QUERY FOR GOOGLE COST

In [29]:
engine = sqlalchemy.create_engine("mysql+pymysql://nitesh.kr:yRpRtyJR0XSqVLibLT@dms002.healthians.co.in/testenv_prod")
query = '''
SELECT SUBSTRING(lcd.campaign_name,1,LOCATE(':',lcd.campaign_name,1)-1) AS 'city',ROUND(SUM(sms_rate),2) AS 'Google_cost' 
FROM lead_campaign_detail lcd
WHERE lcd.vendor_id IN (4,69,118,122) AND DATE(Date_time) = (CURDATE() - INTERVAL 1 day)
GROUP BY city'''
df_Googlecost = pd.read_sql_query(query,engine)
engine.dispose()
df_Googlecost.head()

        city  Google_cost
0                 2339.56
1  Bangalore     20237.71
2    Haryana      1317.10
3  Hyderabad      9347.86
4         MP       774.56

# 7) SQL QUERY FOR CITY & STATE

In [30]:
%pwd
%cd D:\Raw_Data\City Vs State
df_city = pd.read_csv('city_vs_state.csv')

D:\Raw_Data\City Vs State

# 8) No. of days MTD & overall

In [31]:
now = datetime.datetime.now()
mtd_days=1
overall_days=calendar.monthrange(now.year, now.month)[1]

# 11) Booking & Revenue DETAILED

In [32]:
dfg2 = df_master.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfg3=dfg2.drop(columns = 'Lead_City')
dfg4=pd.DataFrame(dfg3.groupby(['State'])['Bookings'].sum())
dfg4.head()
dfg4.reset_index(inplace=True)

var = ['BOOKING_AMOUNT','Allocated_count','Allocated_amount','Cancelled_orders','Rescheduled_OnHold_Orders','Picked_Orders','Overall_Revenue','Phlebo_addon']
for num_var in var:
    dfg5=pd.DataFrame(dfg3.groupby(['State'])[num_var].sum())
    dfg4=pd.merge(dfg4,dfg5,left_on = 'State',right_on = 'State',how = 'inner')
    
dfg7=dfg4[['State','Bookings','BOOKING_AMOUNT','Allocated_count','Allocated_amount','Cancelled_orders','Rescheduled_OnHold_Orders','Picked_Orders','Overall_Revenue','Phlebo_addon']]

def var_sum(x):
    return pd.Series(np.sum(x))


dfg7 = dfg7._get_numeric_data().apply(lambda x : var_sum(x))

df_gross=pd.concat([dfg4,dfg7],sort=False)

df_gross['State'].fillna('Total',inplace = True)
df_gross

,State,Bookings,BOOKING_AMOUNT,Allocated_count,Allocated_amount,Cancelled_orders,Rescheduled_OnHold_Orders,Picked_Orders,Overall_Revenue,Phlebo_addon
0,BLR,70,11613.0,52,5492.0,10.0,8.0,0.0,0.0,0.0
1,Dehradun,22,0.0,20,1358.0,0.0,1.0,0.0,0.0,0.0
2,HR,20,0.0,19,0.0,1.0,0.0,0.0,0.0,0.0
3,Hyderabad,35,4060.0,25,4571.0,5.0,5.0,0.0,0.0,0.0
4,Jaipur,21,5398.0,16,0.0,1.0,2.0,0.0,0.0,0.0
5,MP,27,2867.0,20,2000.0,4.0,2.0,0.0,0.0,0.0
6,Mumbai,72,20791.0,52,0.0,11.0,7.0,0.0,0.0,0.0
7,NCR,476,70161.0,400,18349.0,33.0,22.0,0.0,0.0,0.0
8,PCM,23,2129.0,18,1003.0,0.0,1.0,0.0,0.0,0.0
9,Pune,48,998.0,41,3992.0,7.0,0.0,0.0,0.0,0.0
10,Punjab,37,0.0,33,2508.0,0.0,2.0,0.0,0.0,0.0
11,UP,70,3398.0,58,0.0,9.0,3.0,0.0,0.0,0.0
0,Total,921,121415.0,754,39273.0,81.0,53.0,0.0,0.0,0.0

# 22) GROSS MARGIN DETAILED

In [33]:
df_margin['payed_amount']=df_margin['payed_amount'].apply(pd.to_numeric)

dfm2 = df_margin.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfm3=dfm2.drop(columns = 'Lead_City')
dfm4=pd.DataFrame(dfm3.groupby(['State'])['payed_amount'].sum())
dfm4.head()
dfm4.reset_index(inplace=True)

dfm5=pd.DataFrame(dfm3.groupby(['State'])['sum_addon_cost'].sum())
dfm4=pd.merge(dfm4,dfm5,left_on = 'State',right_on = 'State',how = 'inner')
dfm5=pd.DataFrame(dfm3.groupby(['State'])['order_id'].count())
dfm4=pd.merge(dfm4,dfm5,left_on = 'State',right_on = 'State',how = 'inner')

p=424552*mtd_days/overall_days
p

q_BLR=np.sum(dfm4.iloc[0:1,-1:])
q_BLR

q_HYD=np.sum(dfm4.iloc[3:4,-1:])
q_HYD

cost_prop_BLR = np.sum(p*(q_BLR/(q_HYD+q_BLR)))
cost_prop_BLR

cost_prop_HYD = np.sum(p*(q_HYD/(q_HYD+q_BLR)))
cost_prop_HYD

dfm4['blr_cost']=dfm4['State'].apply(lambda x:cost_prop_BLR if x=='BLR' else cost_prop_HYD if x=='Hyderabad' else 0.0) 
dfm4['Total_Cost']=dfm4['sum_addon_cost']+dfm4['blr_cost']
dfm4['Gross_Margin']=dfm4['payed_amount']-dfm4['Total_Cost']
dfm5=dfm4[['payed_amount', 'sum_addon_cost', 'order_id', 'blr_cost',
        'Total_Cost', 'Gross_Margin']]

def var_sum(x):
    return pd.Series(np.sum(x))

dfm5 = dfm5._get_numeric_data().apply(lambda x : var_sum(x))

dfm4=pd.concat([dfm4,dfm5],sort=False)
dfm4['State'].fillna('Total',inplace = True)

dfm4['Gross_Margin']=round(dfm4['Gross_Margin'],0)
dfm4['Gross_Margin/order']=round(dfm4['Gross_Margin']/dfm4['order_id'],0)
dfm4['Gross_Margin%']=round(dfm4['Gross_Margin']/dfm4['payed_amount'],2)
dfm4['ASP']=round(dfm4['payed_amount']/dfm4['order_id'],0)
df_margin_final=dfm4[['State','Gross_Margin','Gross_Margin/order','Gross_Margin%','ASP']]
df_margin_final

Empty DataFrame
Columns: [State, Gross_Margin, Gross_Margin/order, Gross_Margin%, ASP]
Index: []

# 33) LEADS DATA DETAILED

In [34]:
df_lead.dropna(axis=0,how = 'any').shape

dfl2 = df_lead.merge(df_city,left_on ='CITY',right_on = 'Lead_City', how = 'inner')
dfl3=dfl2.drop(columns = ['Lead_City'])
dfl3=dfl3.drop_duplicates(keep='last')

dfl4=pd.DataFrame(dfl3[(dfl3['Leads_Tag'] == 'Facebook')].groupby(['State'])['Leads'].sum())
dfl4.reset_index(inplace=True)

dfl5=pd.DataFrame(dfl3[(dfl3['Leads_Tag'] == 'Google')].groupby(['State'])['Leads'].sum())

dfl4=pd.merge(dfl4,dfl5,left_on = 'State',right_on = 'State', how = 'inner')
dfl4.rename(columns={'Leads_x':'Facebook','Leads_y':'Google'},inplace=True)

dfl6 = dfl4[['Facebook','Google']]

def var_sum(x):
    return pd.Series(np.sum(x))

dfl6 = dfl6._get_numeric_data().apply(lambda x : var_sum(x))

df_lead_final=pd.concat([dfl4,dfl6],sort=False)
df_lead_final['State'].fillna('Total',inplace = True)
df_lead_final

        State  Facebook  Google
0         BLR       129      54
1    Dehradun        31       7
2          HR        19       3
3   Hyderabad        40      40
4      Jaipur        25       9
5          MP        67       3
6      Mumbai       123      83
7         NCR       300     206
8         PCM        23      11
9        Pune        91      43
10     Punjab        76      11
11         UP       119      22
0       Total      1043     492

# 44) KIT COST DETAILED

In [35]:
dfk2 = df_kit.merge(df_city,left_on ='billing_cust_city',right_on = 'Lead_City', how = 'inner')
dfk3=dfk2.drop(columns = 'Lead_City')
dfk4=pd.DataFrame(dfk3.groupby(['State'])['kit_cost'].sum())
dfk4.head()
dfk4.reset_index(inplace=True)
dfk5 = dfk4[['kit_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfk5 = dfk5._get_numeric_data().apply(lambda x : var_sum(x))

df_kit_Final=pd.concat([dfk4,dfk5],sort=False)
df_kit_Final['State'].fillna('Total',inplace = True)
df_kit_Final

Empty DataFrame
Columns: [State, kit_cost]
Index: []

# 55) FACEBOOK COST DETAILED

In [36]:
df_FBcost['city'].dropna(axis=0,inplace=True)
dfc1=df_FBcost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'left')
dfc1=dfc1.drop(columns = 'Lead_City')
dfc1['State'].dropna(inplace=True)

dfc2=pd.DataFrame(dfc1.groupby(['State'])['Facebook_cost'].sum())
dfc2.head()
dfc2.reset_index(inplace=True)

dfc3 = dfc2[['Facebook_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfc3 = dfc3._get_numeric_data().apply(lambda x : var_sum(x))

df_fbcost_final=pd.concat([dfc2,dfc3],sort=False)
df_fbcost_final['State'].fillna('Total',inplace = True)
df_fbcost_final

        State  Facebook_cost
0         BLR       15947.20
1    Dehradun        3958.29
2          HR        2778.50
3   Hyderabad        6912.12
4      Jaipur        3532.87
5          MP        5007.05
6      Mumbai       13464.61
7         NCR       48496.37
8         PCM        3437.43
9        Pune       10907.52
10     Punjab       12803.21
11         UP       16297.37
0       Total      143542.54

# 66) GOOGLE COST DETAILED

In [37]:
df_Googlecost['city'].dropna(axis=0,inplace=True)
dfc1=df_Googlecost.merge(df_city,left_on ='city',right_on = 'Lead_City', how = 'left')
dfc1=dfc1.drop(columns = 'Lead_City')
dfc1['State'].fillna('NCR',inplace=True)

dfc2=pd.DataFrame(dfc1.groupby(['State'])['Google_cost'].sum())
dfc2.head()
dfc2.reset_index(inplace=True)

dfc3 = dfc2[['Google_cost']]
def var_sum(x):
    return pd.Series(np.sum(x))

dfc3 = dfc3._get_numeric_data().apply(lambda x : var_sum(x))

df_Googlecost_final=pd.concat([dfc2,dfc3],sort=False)
df_Googlecost_final['State'].fillna('Total',inplace = True)
df_Googlecost_final

        State  Google_cost
0         BLR     20237.71
1    Dehradun      1425.16
2          HR      1317.10
3   Hyderabad      9347.86
4      Jaipur      2702.00
5          MP       774.56
6      Mumbai     22273.93
7         NCR     56892.20
8         PCM      3870.77
9        Pune     11602.84
10     Punjab      3172.32
11         UP      6482.61
0       Total    140099.06

# FINAL MERGING OF ALL DF

In [38]:
df_FTD_FINAL1 = pd.merge(df_gross,df_margin_final,left_on='State',right_on='State',how='inner')

In [39]:
df_FTD_FINAL2=pd.merge(df_FTD_FINAL1,df_lead_final,left_on='State',right_on='State',how='inner')

In [40]:
df_FTD_FINAL3=pd.merge(df_FTD_FINAL2,df_kit_Final,left_on='State',right_on='State',how='inner')

In [41]:
df_FTD_FINAL4=pd.merge(df_FTD_FINAL3,df_fbcost_final,left_on='State',right_on='State',how='inner')

In [42]:
df_FTD_FINAL5=pd.merge(df_FTD_FINAL4,df_Googlecost_final,left_on='State',right_on='State',how='inner')
df_FTD_FINAL5

Empty DataFrame
Columns: [Bookings, BOOKING_AMOUNT, Allocated_count, Allocated_amount, Cancelled_orders, Rescheduled_OnHold_Orders, Picked_Orders, Overall_Revenue, Phlebo_addon, Gross_Margin, Gross_Margin/order, Gross_Margin%, ASP, Facebook, Google, kit_cost, Facebook_cost, State, Google_cost]
Index: []

In [43]:
df_FTD_FINAL4.to_csv('df_FTD_FINAL4.csv')

In [44]:
from openpyxl import load_workbook
book = load_workbook('leads_summary.xlsx')
writer = pd.ExcelWriter('leads_summary.xlsx', engine='openpyxl')
writer.book = book
df_FTD_FINAL5.to_excel(writer,sheet_name="FTD",header='infer', index=False,startcol=0,startrow=0)
writer.save()